1.

In [5]:
import findspark
from pyspark.sql import SparkSession
import pandas as pd
from pyspark.sql.types import StructField, StructType, FloatType,StringType, IntegerType

In [7]:
#spark sesssion

findspark.init()
spark=SparkSession.builder.appName('task_dataset').getOrCreate()
spark

In [8]:
# creating data

dataemplyee = [("James","10045.0","Smith",26636.0,"M",111),
    ("Michael","Rose","",42288.0,"M",222),
    ("Robert","","Williams",47114.0,"M",333),
    ("Maria","Anne","Jones",12192.0,"F",111),
    ("Jen","Mary","Brown",80456.0,"F",222),
    ("Jas","","Smith",36634.0,"M",111),
    ("Mike","Rose","",40299.0,"M",222),
    ("Roby","","Williams",42156.0,"M",333),
    ("Ancy","","Williams",42246.0,"M",222),
    ("Mary","Anne","Jones",30002.0,"F",111),
    ("Ben","Mary","Brown",12345.0,"F",222),
    ("Black","Mary","Richard",22345.0,"F",333),
    ("Mike2","Rose","",40299.0,"M",2),
    ("Roby2","","Williams",42156.0,"M",3),
      ]
schemaemp = StructType([
    StructField("firstname",StringType(),True), 
    StructField("middlename",StringType(),True),
    StructField("lastname",StringType(),True),
    StructField("salary", FloatType(), True), 
    StructField("gender", StringType(), True), 
    StructField("dep_id",IntegerType(),True), 
                        ])

In [9]:
emp_df = spark.createDataFrame(dataemplyee,schema=schemaemp)
emp_df.show()

+---------+----------+--------+-------+------+------+
|firstname|middlename|lastname| salary|gender|dep_id|
+---------+----------+--------+-------+------+------+
|    James|   10045.0|   Smith|26636.0|     M|   111|
|  Michael|      Rose|        |42288.0|     M|   222|
|   Robert|          |Williams|47114.0|     M|   333|
|    Maria|      Anne|   Jones|12192.0|     F|   111|
|      Jen|      Mary|   Brown|80456.0|     F|   222|
|      Jas|          |   Smith|36634.0|     M|   111|
|     Mike|      Rose|        |40299.0|     M|   222|
|     Roby|          |Williams|42156.0|     M|   333|
|     Ancy|          |Williams|42246.0|     M|   222|
|     Mary|      Anne|   Jones|30002.0|     F|   111|
|      Ben|      Mary|   Brown|12345.0|     F|   222|
|    Black|      Mary| Richard|22345.0|     F|   333|
|    Mike2|      Rose|        |40299.0|     M|     2|
|    Roby2|          |Williams|42156.0|     M|     3|
+---------+----------+--------+-------+------+------+

In [10]:
emp_pd_df = emp_df.toPandas()
print(emp_pd_df)

   firstname middlename  lastname   salary gender  dep_id
0      James    10045.0     Smith  26636.0      M     111
1    Michael       Rose            42288.0      M     222
2     Robert             Williams  47114.0      M     333
3      Maria       Anne     Jones  12192.0      F     111
4        Jen       Mary     Brown  80456.0      F     222
5        Jas                Smith  36634.0      M     111
6       Mike       Rose            40299.0      M     222
7       Roby             Williams  42156.0      M     333
8       Ancy             Williams  42246.0      M     222
9       Mary       Anne     Jones  30002.0      F     111
10       Ben       Mary     Brown  12345.0      F     222
11     Black       Mary   Richard  22345.0      F     333
12     Mike2       Rose            40299.0      M       2
13     Roby2             Williams  42156.0      M       3

In [11]:
# pd to csv 
emp_csv = emp_pd_df.to_csv('emp_data.csv', index=False)
print("sucessfully converted!")

sucessfully converted!

2.

In [14]:
emp_df_1 = spark.read.csv('C:\spark_training\Challenge\emp_data.csv', inferSchema=True, header=True)
print("reading from csv ")
emp_df_1.printSchema()
emp_df_1.show()

reading from csv
root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- salary: double (nullable = true)
 |-- gender: string (nullable = true)
 |-- dep_id: integer (nullable = true)

+---------+----------+--------+-------+------+------+
|firstname|middlename|lastname| salary|gender|dep_id|
+---------+----------+--------+-------+------+------+
|    James|   10045.0|   Smith|26636.0|     M|   111|
|  Michael|      Rose|    NULL|42288.0|     M|   222|
|   Robert|      NULL|Williams|47114.0|     M|   333|
|    Maria|      Anne|   Jones|12192.0|     F|   111|
|      Jen|      Mary|   Brown|80456.0|     F|   222|
|      Jas|      NULL|   Smith|36634.0|     M|   111|
|     Mike|      Rose|    NULL|40299.0|     M|   222|
|     Roby|      NULL|Williams|42156.0|     M|   333|
|     Ancy|      NULL|Williams|42246.0|     M|   222|
|     Mary|      Anne|   Jones|30002.0|     F|   111|
|      Ben|      Mary|   Brown|12345.0|     F|   222|
|    Black|      Mary| Richard|22345.0|     F|   333|
|    Mike2|      Rose|    NULL|40299.0|     M|     2|
|    Roby2|      NULL|Williams|42156.0|     M|     3|
+---------+----------+--------+-------+------+------+

In [15]:
# transformation

new_emp_df_1 = emp_df_1.withColumn("salary_with_bonus", emp_df_1.salary+10000) 
print("Transformed Spark DataFrame:") 
new_emp_df_1.show()

Transformed Spark DataFrame:
+---------+----------+--------+-------+------+------+-----------------+
|firstname|middlename|lastname| salary|gender|dep_id|salary_with_bonus|
+---------+----------+--------+-------+------+------+-----------------+
|    James|   10045.0|   Smith|26636.0|     M|   111|          36636.0|
|  Michael|      Rose|    NULL|42288.0|     M|   222|          52288.0|
|   Robert|      NULL|Williams|47114.0|     M|   333|          57114.0|
|    Maria|      Anne|   Jones|12192.0|     F|   111|          22192.0|
|      Jen|      Mary|   Brown|80456.0|     F|   222|          90456.0|
|      Jas|      NULL|   Smith|36634.0|     M|   111|          46634.0|
|     Mike|      Rose|    NULL|40299.0|     M|   222|          50299.0|
|     Roby|      NULL|Williams|42156.0|     M|   333|          52156.0|
|     Ancy|      NULL|Williams|42246.0|     M|   222|          52246.0|
|     Mary|      Anne|   Jones|30002.0|     F|   111|          40002.0|
|      Ben|      Mary|   Brown|12345.0|     F|   222|          22345.0|
|    Black|      Mary| Richard|22345.0|     F|   333|          32345.0|
|    Mike2|      Rose|    NULL|40299.0|     M|     2|          50299.0|
|    Roby2|      NULL|Williams|42156.0|     M|     3|          52156.0|
+---------+----------+--------+-------+------+------+-----------------+

In [16]:
new_emp_df_1_pd = new_emp_df_1.toPandas()
print(new_emp_df_1_pd)

   firstname middlename  lastname   salary gender  dep_id  salary_with_bonus
0      James    10045.0     Smith  26636.0      M     111            36636.0
1    Michael       Rose      None  42288.0      M     222            52288.0
2     Robert       None  Williams  47114.0      M     333            57114.0
3      Maria       Anne     Jones  12192.0      F     111            22192.0
4        Jen       Mary     Brown  80456.0      F     222            90456.0
5        Jas       None     Smith  36634.0      M     111            46634.0
6       Mike       Rose      None  40299.0      M     222            50299.0
7       Roby       None  Williams  42156.0      M     333            52156.0
8       Ancy       None  Williams  42246.0      M     222            52246.0
9       Mary       Anne     Jones  30002.0      F     111            40002.0
10       Ben       Mary     Brown  12345.0      F     222            22345.0
11     Black       Mary   Richard  22345.0      F     333            32345.0
12     Mike2       Rose      None  40299.0      M       2            50299.0
13     Roby2       None  Williams  42156.0      M       3            52156.0

In [17]:
new_emp_df_1_csv=new_emp_df_1_pd.to_csv('new_emp_data.csv', index=False)

In [18]:
parquet=new_emp_df_1.write.mode("overwrite").parquet("new_emp_data.parquet")

4.

In [19]:

df_pandas_parquet_read = pd.read_parquet("C:\\spark_training\\Challenge\\new_emp_data.parquet") 
print("Read Parquet into Pandas DataFrame:") 
print(df_pandas_parquet_read)

Read Parquet into Pandas DataFrame:
   firstname middlename  lastname   salary gender  dep_id  salary_with_bonus
0      James    10045.0     Smith  26636.0      M     111            36636.0
1    Michael       Rose      None  42288.0      M     222            52288.0
2     Robert       None  Williams  47114.0      M     333            57114.0
3      Maria       Anne     Jones  12192.0      F     111            22192.0
4        Jen       Mary     Brown  80456.0      F     222            90456.0
5        Jas       None     Smith  36634.0      M     111            46634.0
6       Mike       Rose      None  40299.0      M     222            50299.0
7       Roby       None  Williams  42156.0      M     333            52156.0
8       Ancy       None  Williams  42246.0      M     222            52246.0
9       Mary       Anne     Jones  30002.0      F     111            40002.0
10       Ben       Mary     Brown  12345.0      F     222            22345.0
11     Black       Mary   Richard  22345.0      F     333            32345.0
12     Mike2       Rose      None  40299.0      M       2            50299.0
13     Roby2       None  Williams  42156.0      M       3            52156.0

In [20]:
5.

5.0

In [21]:
df_spark_parquet = spark.createDataFrame(df_pandas_parquet_read)
df_spark_parquet.show()

+---------+----------+--------+-------+------+------+-----------------+
|firstname|middlename|lastname| salary|gender|dep_id|salary_with_bonus|
+---------+----------+--------+-------+------+------+-----------------+
|    James|   10045.0|   Smith|26636.0|     M|   111|          36636.0|
|  Michael|      Rose|    NULL|42288.0|     M|   222|          52288.0|
|   Robert|      NULL|Williams|47114.0|     M|   333|          57114.0|
|    Maria|      Anne|   Jones|12192.0|     F|   111|          22192.0|
|      Jen|      Mary|   Brown|80456.0|     F|   222|          90456.0|
|      Jas|      NULL|   Smith|36634.0|     M|   111|          46634.0|
|     Mike|      Rose|    NULL|40299.0|     M|   222|          50299.0|
|     Roby|      NULL|Williams|42156.0|     M|   333|          52156.0|
|     Ancy|      NULL|Williams|42246.0|     M|   222|          52246.0|
|     Mary|      Anne|   Jones|30002.0|     F|   111|          40002.0|
|      Ben|      Mary|   Brown|12345.0|     F|   222|          22345.0|
|    Black|      Mary| Richard|22345.0|     F|   333|          32345.0|
|    Mike2|      Rose|    NULL|40299.0|     M|     2|          50299.0|
|    Roby2|      NULL|Williams|42156.0|     M|     3|          52156.0|
+---------+----------+--------+-------+------+------+-----------------+

In [23]:
df_transformed_parquet = df_spark_parquet.withColumnRenamed("firstname", "first_name")
df_transformed_parquet.show()

+----------+----------+--------+-------+------+------+-----------------+
|first_name|middlename|lastname| salary|gender|dep_id|salary_with_bonus|
+----------+----------+--------+-------+------+------+-----------------+
|     James|   10045.0|   Smith|26636.0|     M|   111|          36636.0|
|   Michael|      Rose|    NULL|42288.0|     M|   222|          52288.0|
|    Robert|      NULL|Williams|47114.0|     M|   333|          57114.0|
|     Maria|      Anne|   Jones|12192.0|     F|   111|          22192.0|
|       Jen|      Mary|   Brown|80456.0|     F|   222|          90456.0|
|       Jas|      NULL|   Smith|36634.0|     M|   111|          46634.0|
|      Mike|      Rose|    NULL|40299.0|     M|   222|          50299.0|
|      Roby|      NULL|Williams|42156.0|     M|   333|          52156.0|
|      Ancy|      NULL|Williams|42246.0|     M|   222|          52246.0|
|      Mary|      Anne|   Jones|30002.0|     F|   111|          40002.0|
|       Ben|      Mary|   Brown|12345.0|     F|   222|          22345.0|
|     Black|      Mary| Richard|22345.0|     F|   333|          32345.0|
|     Mike2|      Rose|    NULL|40299.0|     M|     2|          50299.0|
|     Roby2|      NULL|Williams|42156.0|     M|     3|          52156.0|
+----------+----------+--------+-------+------+------+-----------------+

In [ ]:
df_transformed_pandas_parquet = df_transformed_parquet.toPandas() 
print("Converted Transformed DataFrame to Pandas:")

Converted Transformed DataFrame to Pandas:

In [25]:
print(df_transformed_pandas_parquet)

   first_name middlename  lastname   salary gender  dep_id  salary_with_bonus
0       James    10045.0     Smith  26636.0      M     111            36636.0
1     Michael       Rose      None  42288.0      M     222            52288.0
2      Robert       None  Williams  47114.0      M     333            57114.0
3       Maria       Anne     Jones  12192.0      F     111            22192.0
4         Jen       Mary     Brown  80456.0      F     222            90456.0
5         Jas       None     Smith  36634.0      M     111            46634.0
6        Mike       Rose      None  40299.0      M     222            50299.0
7        Roby       None  Williams  42156.0      M     333            52156.0
8        Ancy       None  Williams  42246.0      M     222            52246.0
9        Mary       Anne     Jones  30002.0      F     111            40002.0
10        Ben       Mary     Brown  12345.0      F     222            22345.0
11      Black       Mary   Richard  22345.0      F     333            32345.0
12      Mike2       Rose      None  40299.0      M       2            50299.0
13      Roby2       None  Williams  42156.0      M       3            52156.0

In [27]:
df_transformed_pandas_parquet_1=df_transformed_pandas_parquet.to_parquet("final.parquet")
print("converted into parquet!")

converted into parquet!

In [28]:
print ("Below is the spark data frame! ")
df_spark_parquet.show()

Below is the spark data frame!
+---------+----------+--------+-------+------+------+-----------------+
|firstname|middlename|lastname| salary|gender|dep_id|salary_with_bonus|
+---------+----------+--------+-------+------+------+-----------------+
|    James|   10045.0|   Smith|26636.0|     M|   111|          36636.0|
|  Michael|      Rose|    NULL|42288.0|     M|   222|          52288.0|
|   Robert|      NULL|Williams|47114.0|     M|   333|          57114.0|
|    Maria|      Anne|   Jones|12192.0|     F|   111|          22192.0|
|      Jen|      Mary|   Brown|80456.0|     F|   222|          90456.0|
|      Jas|      NULL|   Smith|36634.0|     M|   111|          46634.0|
|     Mike|      Rose|    NULL|40299.0|     M|   222|          50299.0|
|     Roby|      NULL|Williams|42156.0|     M|   333|          52156.0|
|     Ancy|      NULL|Williams|42246.0|     M|   222|          52246.0|
|     Mary|      Anne|   Jones|30002.0|     F|   111|          40002.0|
|      Ben|      Mary|   Brown|12345.0|     F|   222|          22345.0|
|    Black|      Mary| Richard|22345.0|     F|   333|          32345.0|
|    Mike2|      Rose|    NULL|40299.0|     M|     2|          50299.0|
|    Roby2|      NULL|Williams|42156.0|     M|     3|          52156.0|
+---------+----------+--------+-------+------+------+-----------------+

converted directly from spark to parquet

In [29]:
challenge_1=df_spark_parquet.write.mode("overwrite").parquet("challenge_file.parquet")

spark to csv

In [30]:
challenge_2 = df_spark_parquet.write.csv("challenge_file.csv")
print ("converted to csv sucessfully!")

converted to csv sucessfully!